/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Niektóre]@ z poniższych są prawdziwe";
"%[All]@ of the following are true" = "%1$[Wszystkie]@ z poniższych są prawdziwe";
"%[None]@ of the following are true" = "%1$[Żadne]@ z poniższych warunków nie są spełnione";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Rodzaj]@ jest %2$[dowolny]@";
"%[Kind]@ is %[applications]@" = "%1$[Rodzaj]@ jest %2$[program]@";
"%[Kind]@ is %[documents]@" = "%1$[Rodzaj]@ jest %2$[dokument]@";
"%[Kind]@ is %[folders]@" = "%1$[Rodzaj]@ jest %2$[katalog]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Rodzaj]@ jest %2$[obrazek]@ %3$[dowolny]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Rodzaj]@ jest %2$[obrazek]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Rodzaj]@ jest %2$[obrazek]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Rodzaj]@ jest %2$[obrazek]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Rodzaj]@ jest %2$[obrazek]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Rodzaj]@ jest %2$[obrazek]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Rodzaj]@ jest %2$[muzyka]@ %3$[dowolna]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Rodzaj]@ jest %2$[muzyka]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Rodzaj]@ jest %2$[muzyka]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Rodzaj]@ jest %2$[muzyka]@ %3$[zakupiona]@";
"%[Kind]@ is %[PDF]@" = "%1$[Rodzaj]@ jest %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Rodzaj]@ jest %2$[prezentacja]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Rodzaj]@ jest %2$[tekst]@ %3$[dowolny]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Rodzaj]@ jest %2$[tekst]@ %3$[zwykły]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Rodzaj]@ jest %2$[tekst]@ %3$[sformatowany]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Rodzaj]@ jest %2$[tekst]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Rodzaj]@ jest %2$[tekst]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Rodzaj]@ jest %2$[tekst]@ %3$[kod źródłowy]@";
"%[Kind]@ is %[movies]@" = "%1$[Rodzaj]@ jest %2$[film]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Rodzaj]@ jest %2$[inny]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ jest %2$[w ciągu ostatnich]@ %3$@ %4$[dni]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ jest %2$[w ciągu ostatnich]@ %3$@ %4$[tygodni]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ jest %2$[w ciągu ostatnich]@ %3$@ %4$[miesięcy]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ jest %2$[w ciągu ostatnich]@ %3$@ %4$[lat]@";
"%@ is %[exactly]@ %@" = "%1$@ jest %2$[dokładnie]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ jest %2$[przed]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ jest %2$[po]@ %3$@";
"%@ is %[today]@" = "%1$@ jest %2$[dzisiaj]@";
"%@ is %[yesterday]@" = "%1$@ jest %2$[wczoraj]@";
"%@ is %[this week]@" = "%1$@ jest %2$[w tym tygodniu]@";
"%@ is %[this month]@" = "%1$@ jest %2$[w tym miesiącu]@";
"%@ is %[this year]@" = "%1$@ jest %2$[w tym roku]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[zawiera]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[zaczyna się od]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[kończy się na]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[jest]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[spełnia]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[dowolny]@";
"%@ %[yes]@" = "%1$@ %2$[tak]@";
"%@ %[no]@" = "%1$@ %2$[nie]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[Widoczność pliku]@ %2$[rzeczy widoczne]@";
"%[File invisible]@ %[invisible items]@" = "%1$[Widoczność pliku]@ %2$[rzeczy niewidoczne]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[Widoczność pliku]@ %2$[widoczne lub niewidoczne]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Proste zapytanie]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[Rozszerzenie pliku]@ %2$[jest]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[równa się]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[jest większe niż]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[jest mniejsze]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[nie jest]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ zawiera %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[równa się]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[równa się]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[równa się]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[jest mniejsze]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[jest mniejsze]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[jest mniejsze]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[jest większe niż]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[jest większe niż]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[jest większe niż]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[nie jest]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[nie jest]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[nie jest]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[równa się]@ %3$@ godz. %4$@ min. %5$@ sek.";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[jest mniejsze]@ %3$@ godz. %4$@ min. i %5$@ sek.";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[jest większe niż]@ %3$@ godz. %4$@ min. i %5$@ sek.";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[nie jest]@ %3$@ godz. %4$@ min. i %5$@ sek.";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[rzeczy pokrywające się z tekstem]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[Pliki systemowe]@ %2$[są uwzględniane]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[Pliki systemowe]@ %2$[nie są uwzględniane]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Rzeczy Spotlight]@ %2$[są uwzględniane]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Rzeczy Spotlight]@ %2$[nie są uwzględniane]@";

